dw 向后删一个词   M-d
de 向后删一句  M-k
dd 删一行 C-k
^ 移动到行首 C-a
$ 移动到行尾 C-e
C-b pageup M-v
C-f pagedown C-v
G 移动到末行 M->
H 当前窗口的首行
M：移动到当前窗口的中间位置；  
L：移动光标到当前窗口的最后一行；

w:光标移动到下一个单词的词首 M-f
2w:重复执行w操作2次；  C-u 2 M-f
e:光标移动到下一个单词的词尾；  
5e:重复执行e操作5次；  
b：向前移动光标，移动到前一个单词的词首；M-b

):光标移动到下一句； M-e

(:光标移动到上一句；M-a

3):光标移动到向下3句


{:向上移动一个段落；

}:向下移动一个段落

3}:向下移动3个段落
以上文本有8行，当处在第6行编辑时，发现第2行好像有问题，需要修改，为了记住现在操作的行，可以作一个标记，ma，
然后2G（跳到第2行），操作完后，回到Normal模式（按ESC），执行 'a(注意a的前面有个单引号)，则会回到之前操作的第8行。
操作说明：

m+单词（单词为a-z或者A-Z） C-space

如果再需要一个标记，则可以mb,返回则执行'b;  C-u C-space

u undo C-x u

S-insert 插入(粘帖) C-y

yy 複製游標所在行整行。或大寫一個 Y。 2yy 或 y2y 複製兩行，請舉一反三好不好！:-) y^ 複製至行首，或 y0。
不含游標所在處字元。 y$ 複製至行尾。含游標所在處字元。 yw 複製一個 word。 y2w 複製兩個字。 yG 複製至檔尾。
y1G 複製至檔首。 p 小寫 p 代表貼至游標後（下）。 P 大寫 P 代表貼至游標前（上）。

整行的複製，按 p 或 P 時是插入式的貼在下（上）一行。非整行的複製則是貼在游標所在處之後（前）。
